InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
/**
 *
 * @file SYSCTL_RegisterPeripheral_Bitbanding.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 23 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 23 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_BITBANDING_H_
#define XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_BITBANDING_H_

#include <xDriver_MCU/SYSCTL/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines.h>
#include <xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterAddress.h>
#include <xDriver_MCU/SYSCTL/Peripheral/Struct/xHeader/SYSCTL_StructPeripheral_Bitbanding.h>

#define SYSCTL_BITBANDING    ((SYSCTL_BITBANDING_TypeDef*) (SYSCTL_BITBANDING_BASE + SYSCTL_OFFSET * 32UL))

/*******************************************************************************************
************************************ 1 DID0 *********************************************
*******************************************************************************************/
#define SYSCTL_BITBANDING_DID0    ((BITBANDING_DID0_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DID0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 2 DID1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DID1    ((BITBANDING_DID1_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DID1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 3 PBORCTL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PBORCTL    ((BITBANDING_PBORCTL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PBORCTL_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PBORCTL_BOR1 (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PBORCTL_OFFSET) * 32UL) + (SYSCTL_PBORCTL_R_BOR1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PBORCTL_BOR0 (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PBORCTL_OFFSET) * 32UL) + (SYSCTL_PBORCTL_R_BOR0_BIT * 4UL))))

/******************************************************************************************
************************************ 4 RIS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RIS    ((BITBANDING_RIS_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RIS_BOR1RIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_BOR1RIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_MOFRIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_MOFRIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_PLLLRIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_PLLLRIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_USBPLLLRIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_USBPLLLRIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_MOSCPUPRIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_MOSCPUPRIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_VDDARIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_VDDARIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_BOR0RIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_BOR0RIS_BIT * 4UL))))

/******************************************************************************************
************************************ 5 IMC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_IMC    ((BITBANDING_IMC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_IMC_BOR1IM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_BOR1IM_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_MOFIM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_MOFIM_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_PLLLIM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_PLLLIM_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_USBPLLLIM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_USBPLLLIM_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_MOSCPUPIM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_MOSCPUPIM_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_VDDAIM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_VDDAIM_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_BOR0IM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_BOR0IM_BIT * 4UL))))

/******************************************************************************************
************************************ 6 MISC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_MISC    ((BITBANDING_MISC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_MISC_BOR1MIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_BOR1MIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_MOFMIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_MOFMIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_PLLLMIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_PLLLMIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_USBPLLLMIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_USBPLLLMIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_MOSCPUPMIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_MOSCPUPMIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_VDDAMIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_VDDAMIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_BOR0MIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_BOR0MIS_BIT * 4UL))))

/******************************************************************************************
************************************ 7 RESC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RESC    ((BITBANDING_RESC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RESC_EXT    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_EXT_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_POR    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_POR_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_BOR    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_BOR_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_WDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_SW    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_SW_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_WDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_WDT1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_MOSCFAIL (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_MOSCFAIL_BIT * 4UL))))

/******************************************************************************************
************************************ 8 RCC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCC    ((BITBANDING_RCC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCC_MOSCDIS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC_OFFSET) * 32UL) + (SYSCTL_RCC_R_MOSCDIS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC_BYPASS    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC_OFFSET) * 32UL) + (SYSCTL_RCC_R_BYPASS_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC_PWRDN    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC_OFFSET) * 32UL) + (SYSCTL_RCC_R_PWRDN_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC_USEPWMDIV (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC_OFFSET) * 32UL) + (SYSCTL_RCC_R_USEPWMDIV_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC_USESYSDIV (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC_OFFSET) * 32UL) + (SYSCTL_RCC_R_USESYSDIV_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC_ACG    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC_OFFSET) * 32UL) + (SYSCTL_RCC_R_ACG_BIT * 4UL))))

/******************************************************************************************
************************************ 9 GPIOHBCTL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_GPIOBHCTL    ((BITBANDING_GPIOBHCTL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_GPIOBHCTL_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_GPIOHBCTL_PORTA (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_GPIOHBCTL_OFFSET) * 32UL) + (SYSCTL_GPIOHBCTL_R_PORTA_BIT * 4UL))))
#define SYSCTL_BITBANDING_GPIOHBCTL_PORTB (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_GPIOHBCTL_OFFSET) * 32UL) + (SYSCTL_GPIOHBCTL_R_PORTB_BIT * 4UL))))
#define SYSCTL_BITBANDING_GPIOHBCTL_PORTC (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_GPIOHBCTL_OFFSET) * 32UL) + (SYSCTL_GPIOHBCTL_R_PORTC_BIT * 4UL))))
#define SYSCTL_BITBANDING_GPIOHBCTL_PORTD (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_GPIOHBCTL_OFFSET) * 32UL) + (SYSCTL_GPIOHBCTL_R_PORTD_BIT * 4UL))))
#define SYSCTL_BITBANDING_GPIOHBCTL_PORTE (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_GPIOHBCTL_OFFSET) * 32UL) + (SYSCTL_GPIOHBCTL_R_PORTE_BIT * 4UL))))
#define SYSCTL_BITBANDING_GPIOHBCTL_PORTF (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_GPIOHBCTL_OFFSET) * 32UL) + (SYSCTL_GPIOHBCTL_R_PORTF_BIT * 4UL))))

/******************************************************************************************
************************************ 10 RCC2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCC2    ((BITBANDING_RCC2_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC2_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCC2_BYPASS2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC2_OFFSET) * 32UL) + (SYSCTL_RCC2_R_BYPASS2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC2_PWRDN2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC2_OFFSET) * 32UL) + (SYSCTL_RCC2_R_PWRDN2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC2_USBPWRDN    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC2_OFFSET) * 32UL) + (SYSCTL_RCC2_R_USBPWRDN_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC2_SYSDIV2LSB (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC2_OFFSET) * 32UL) + (SYSCTL_RCC2_R_SYSDIV2LSB_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC2_DIV400 (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC2_OFFSET) * 32UL) + (SYSCTL_RCC2_R_DIV400_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCC2_USERCC2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCC2_OFFSET) * 32UL) + (SYSCTL_RCC2_R_USERCC2_BIT * 4UL))))

/******************************************************************************************
************************************ 11 MOSCCTL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_MOSCCTL    ((BITBANDING_MOSCCTL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MOSCCTL_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_MOSCCTL_CVAL    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MOSCCTL_OFFSET) * 32UL) + (SYSCTL_MOSCCTL_R_CVAL_BIT * 4UL))))
#define SYSCTL_BITBANDING_MOSCCTL_MOSCIM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MOSCCTL_OFFSET) * 32UL) + (SYSCTL_MOSCCTL_R_MOSCIM_BIT * 4UL))))
#define SYSCTL_BITBANDING_MOSCCTL_NOXTAL    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MOSCCTL_OFFSET) * 32UL) + (SYSCTL_MOSCCTL_R_NOXTAL_BIT * 4UL))))

/******************************************************************************************
************************************12 DSLPCLKCFG *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DSLPCLKCFG    ((BITBANDING_DSLPCLKCFG_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DSLPCLKCFG_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DSLPCLKCFG_PIOSCPD    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DSLPCLKCFG_OFFSET) * 32UL) + (SYSCTL_DSLPCLKCFG_R_PIOSCPD_BIT * 4UL))))

/******************************************************************************************
************************************13 SYSPROP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SYSPROP    ((BITBANDING_SYSPROP_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SYSPROP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SYSPROP_FPU    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SYSPROP_OFFSET) * 32UL) + (SYSCTL_SYSPROP_R_FPU_BIT * 4UL))))
#define SYSCTL_BITBANDING_SYSPROP_FLASHLPM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SYSPROP_OFFSET) * 32UL) + (SYSCTL_SYSPROP_R_FLASHLPM_BIT * 4UL))))
#define SYSCTL_BITBANDING_SYSPROP_SRAMLPM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SYSPROP_OFFSET) * 32UL) + (SYSCTL_SYSPROP_R_SRAMLPM_BIT * 4UL))))
#define SYSCTL_BITBANDING_SYSPROP_SRAMSM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SYSPROP_OFFSET) * 32UL) + (SYSCTL_SYSPROP_R_SRAMSM_BIT * 4UL))))
#define SYSCTL_BITBANDING_SYSPROP_PIOSCPDE    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SYSPROP_OFFSET) * 32UL) + (SYSCTL_SYSPROP_R_PIOSCPDE_BIT * 4UL))))

/******************************************************************************************
************************************14 PIOSCCAL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PIOSCCAL    ((BITBANDING_PIOSCCAL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PIOSCCAL_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PIOSCCAL_UPDATE    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PIOSCCAL_OFFSET) * 32UL) + (SYSCTL_PIOSCCAL_R_UPDATE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PIOSCCAL_CAL    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PIOSCCAL_OFFSET) * 32UL) + (SYSCTL_PIOSCCAL_R_CAL_BIT * 4UL))))
#define SYSCTL_BITBANDING_PIOSCCAL_UTEN    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PIOSCCAL_OFFSET) * 32UL) + (SYSCTL_PIOSCCAL_R_UTEN_BIT * 4UL))))

/******************************************************************************************
************************************15 PIOSCSTAT *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PIOSCSTAT    ((BITBANDING_PIOSCSTAT_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PIOSCSTAT_OFFSET) * 32UL)))

/******************************************************************************************
************************************16 PLLFREQ0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PLLFREQ0    ((BITBANDING_PLLFREQ0_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PLLFREQ0_OFFSET) * 32UL)))

/******************************************************************************************
************************************17 PLLFREQ1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PLLFREQ1    ((BITBANDING_PLLFREQ1_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PLLFREQ1_OFFSET) * 32UL)))

/******************************************************************************************
************************************18 PLLSTAT *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PLLSTAT    ((BITBANDING_PLLSTAT_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PLLSTAT_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PLLSTAT_LOCK    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PLLSTAT_OFFSET) * 32UL) + (SYSCTL_PLLSTAT_R_LOCK_BIT * 4UL))))

/******************************************************************************************
************************************19 SLSRWRCFG *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SLSRWRCFG    ((BITBANDING_SLSRWRCFG_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SLSRWRCFG_OFFSET) * 32UL)))

/******************************************************************************************
************************************20 DSLSRWRCFG *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DSLSRWRCFG    ((BITBANDING_DSLSRWRCFG_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DSLSRWRCFG_OFFSET) * 32UL)))

/******************************************************************************************
************************************21 LDOSPCTL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_LDOSPCTL    ((BITBANDING_LDOSPCTL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_LDOSPCTL_OFFSET) * 32UL)))

