InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_LDOSPCTL_VADJEN    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_LDOSPCTL_OFFSET) * 32UL) + (SYSCTL_LDOSPCTL_R_VADJEN_BIT * 4UL))))

/******************************************************************************************
************************************22 LDOSPCAL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_LDOSPCAL    ((BITBANDING_LDOSPCAL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_LDOSPCAL_OFFSET) * 32UL)))

/******************************************************************************************
************************************23 LDODPCTL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_LDODPCTL    ((BITBANDING_LDODPCTL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_LDODPCTL_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_LDODPCTL_VADJEN    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_LDODPCTL_OFFSET) * 32UL) + (SYSCTL_LDODPCTL_R_VADJEN_BIT * 4UL))))

/******************************************************************************************
************************************24 LDODPCAL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_LDODPCAL    ((BITBANDING_LDODPCAL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_LDODPCAL_OFFSET) * 32UL)))

/******************************************************************************************
************************************25 SDPMST *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SDPMST    ((BITBANDING_SDPMST_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SDPMST_SPDERR    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_SPDERR_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_FPDERR    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_FPDERR_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_SRDERR    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_SRDERR_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_LDMINERR (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_LDMINERR_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_LSMINERR (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_LSMINERR_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_LMAXERR    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_LMAXERR_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_SRDW    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_SRDW_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_PRACT    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_PRACT_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_LOWPWR    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_LOWPWR_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_FLASHLP    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_FLASHLP_BIT * 4UL))))
#define SYSCTL_BITBANDING_SDPMST_LDOUA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SDPMST_OFFSET) * 32UL) + (SYSCTL_SDPMST_R_LDOUA_BIT * 4UL))))

/******************************************************************************************
************************************26 PPWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPWD    ((BITBANDING_PERIPHERAL_WD_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPWD_WDT0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWD_OFFSET) * 32UL) + (SYSCTL_PPWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPWD_WDT1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWD_OFFSET) * 32UL) + (SYSCTL_PPWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************27 PPTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPTIMER    ((BITBANDING_PERIPHERAL_TIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPTIMER_TIMER0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER5_BIT * 4UL))))

/******************************************************************************************
************************************28 PPGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_TypeDef*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOA    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOB    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOC    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOD    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOE    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOF    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOG    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOH    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOJ    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOK    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOL    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOM    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPION    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOP    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOQ    (*((volatile const uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************29 PPDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPDMA    ((BITBANDING_PERIPHERAL_DMA_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPDMA_OFFSET) * 32UL)))

