InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PPDMA_UDMA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPDMA_OFFSET) * 32UL) + (SYSCTL_PPDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************30 PPHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPHIB    ((BITBANDING_PERIPHERAL_HIB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPHIB_HIB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPHIB_OFFSET) * 32UL) + (SYSCTL_PPHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************31 PPUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPUART    ((BITBANDING_PERIPHERAL_UART_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPUART_UART0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************32 PPSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPSSI    ((BITBANDING_PERIPHERAL_SSI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPSSI_SSI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPSSI_SSI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPSSI_SSI2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPSSI_SSI3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************33 PPI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPI2C    ((BITBANDING_PERIPHERAL_I2C_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPI2C_I2C0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C5_BIT * 4UL))))

/******************************************************************************************
************************************34 PPUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPUSB    ((BITBANDING_PERIPHERAL_USB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPUSB_USB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUSB_OFFSET) * 32UL) + (SYSCTL_PPUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************35 PPCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPCAN    ((BITBANDING_PERIPHERAL_CAN_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCAN_OFFSET) * 32UL)))

