InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PPCAN_CAN0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCAN_OFFSET) * 32UL) + (SYSCTL_PPCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPCAN_CAN1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCAN_OFFSET) * 32UL) + (SYSCTL_PPCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************36 PPADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPADC    ((BITBANDING_PERIPHERAL_ADC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPADC_ADC0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPADC_OFFSET) * 32UL) + (SYSCTL_PPADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPADC_ADC1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPADC_OFFSET) * 32UL) + (SYSCTL_PPADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************37 PPACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPACMP    ((BITBANDING_PERIPHERAL_ACMP_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPACMP_ACMP    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPACMP_OFFSET) * 32UL) + (SYSCTL_PPACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************38 PPPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPPWM    ((BITBANDING_PERIPHERAL_PWM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPPWM_PWM0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPWM_OFFSET) * 32UL) + (SYSCTL_PPPWM_R_PWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPPWM_PWM1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPWM_OFFSET) * 32UL) + (SYSCTL_PPPWM_R_PWM1_BIT * 4UL))))

/******************************************************************************************
************************************39 PPQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPQEI    ((BITBANDING_PERIPHERAL_QEI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPQEI_QEI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPQEI_OFFSET) * 32UL) + (SYSCTL_PPQEI_R_QEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPQEI_QEI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPQEI_OFFSET) * 32UL) + (SYSCTL_PPQEI_R_QEI1_BIT * 4UL))))

/******************************************************************************************
************************************40 PPEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPEEPROM_EEPROM    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEEPROM_OFFSET) * 32UL) + (SYSCTL_PPEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************41 PPWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPWTIMER_WTIMER0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL) + (SYSCTL_PPWTIMER_R_WTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPWTIMER_WTIMER1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL) + (SYSCTL_PPWTIMER_R_WTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPWTIMER_WTIMER2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL) + (SYSCTL_PPWTIMER_R_WTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPWTIMER_WTIMER3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL) + (SYSCTL_PPWTIMER_R_WTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPWTIMER_WTIMER4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL) + (SYSCTL_PPWTIMER_R_WTIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPWTIMER_WTIMER5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL) + (SYSCTL_PPWTIMER_R_WTIMER5_BIT * 4UL))))

/******************************************************************************************
************************************42 SRWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRWD    ((BITBANDING_PERIPHERAL_WD_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRWD_WDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWD_OFFSET) * 32UL) + (SYSCTL_SRWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRWD_WDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWD_OFFSET) * 32UL) + (SYSCTL_SRWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************43 SRTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRTIMER    ((BITBANDING_PERIPHERAL_TIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL)))

