InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SRTIMER_TIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER5_BIT * 4UL))))

/******************************************************************************************
************************************44 SRGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_TypeDef*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOA    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOB    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOC    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOD    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOE    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOF    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOG    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOH    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOJ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOK    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOL    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOM    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPION    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOP    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOQ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************45 SRDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRDMA    ((BITBANDING_PERIPHERAL_DMA_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRDMA_UDMA    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRDMA_OFFSET) * 32UL) + (SYSCTL_SRDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************46 SRHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRHIB    ((BITBANDING_PERIPHERAL_HIB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRHIB_HIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRHIB_OFFSET) * 32UL) + (SYSCTL_SRHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************47 SRUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRUART    ((BITBANDING_PERIPHERAL_UART_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRUART_UART0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART6    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART7    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************48 SRSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRSSI    ((BITBANDING_PERIPHERAL_SSI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRSSI_SSI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRSSI_SSI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRSSI_SSI2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRSSI_SSI3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************49 SRI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRI2C    ((BITBANDING_PERIPHERAL_I2C_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRI2C_I2C0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C5_BIT * 4UL))))

/******************************************************************************************
************************************50 SRUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRUSB    ((BITBANDING_PERIPHERAL_USB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRUSB_USB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUSB_OFFSET) * 32UL) + (SYSCTL_SRUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************51 SRCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRCAN    ((BITBANDING_PERIPHERAL_CAN_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRCAN_CAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCAN_OFFSET) * 32UL) + (SYSCTL_SRCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCAN_CAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCAN_OFFSET) * 32UL) + (SYSCTL_SRCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************52 SRADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRADC    ((BITBANDING_PERIPHERAL_ADC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRADC_OFFSET) * 32UL)))

