InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SRADC_ADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRADC_OFFSET) * 32UL) + (SYSCTL_SRADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRADC_ADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRADC_OFFSET) * 32UL) + (SYSCTL_SRADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************53 SRACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRACMP    ((BITBANDING_PERIPHERAL_ACMP_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRACMP_ACMP    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRACMP_OFFSET) * 32UL) + (SYSCTL_SRACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************54 SRPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRPWM    ((BITBANDING_PERIPHERAL_PWM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRPWM_PWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPWM_OFFSET) * 32UL) + (SYSCTL_SRPWM_R_PWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRPWM_PWM1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPWM_OFFSET) * 32UL) + (SYSCTL_SRPWM_R_PWM1_BIT * 4UL))))

/******************************************************************************************
************************************55 SRQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRQEI    ((BITBANDING_PERIPHERAL_QEI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRQEI_QEI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRQEI_OFFSET) * 32UL) + (SYSCTL_SRQEI_R_QEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRQEI_QEI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRQEI_OFFSET) * 32UL) + (SYSCTL_SRQEI_R_QEI1_BIT * 4UL))))

/******************************************************************************************
************************************56 SREEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SREEPROM    ((BITBANDING_PERIPHERAL_EEPROM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SREEPROM_EEPROM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREEPROM_OFFSET) * 32UL) + (SYSCTL_SREEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************57 SRWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRWTIMER_WTIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL) + (SYSCTL_SRWTIMER_R_WTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRWTIMER_WTIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL) + (SYSCTL_SRWTIMER_R_WTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRWTIMER_WTIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL) + (SYSCTL_SRWTIMER_R_WTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRWTIMER_WTIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL) + (SYSCTL_SRWTIMER_R_WTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRWTIMER_WTIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL) + (SYSCTL_SRWTIMER_R_WTIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRWTIMER_WTIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL) + (SYSCTL_SRWTIMER_R_WTIMER5_BIT * 4UL))))

/******************************************************************************************
************************************58 RCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCWD    ((BITBANDING_PERIPHERAL_WD_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCWD_WDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWD_OFFSET) * 32UL) + (SYSCTL_RCGCWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCWD_WDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWD_OFFSET) * 32UL) + (SYSCTL_RCGCWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************59 RCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCTIMER    ((BITBANDING_PERIPHERAL_TIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCTIMER_TIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER5_BIT * 4UL))))

/******************************************************************************************
************************************60 RCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_TypeDef*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOA    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOB    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOC    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOD    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOE    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOF    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOG    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOH    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOJ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOK    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOL    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOM    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPION    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOP    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOQ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************61 RCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCDMA    ((BITBANDING_PERIPHERAL_DMA_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCDMA_UDMA    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCDMA_OFFSET) * 32UL) + (SYSCTL_RCGCDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************62 RCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCHIB    ((BITBANDING_PERIPHERAL_HIB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCHIB_OFFSET) * 32UL)))

