InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_RCGCHIB_HIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCHIB_OFFSET) * 32UL) + (SYSCTL_RCGCHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************63 RCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCUART    ((BITBANDING_PERIPHERAL_UART_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCUART_UART0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART6    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART7    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************64 RCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCSSI    ((BITBANDING_PERIPHERAL_SSI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCSSI_SSI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCSSI_SSI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCSSI_SSI2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCSSI_SSI3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************65 RCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCI2C    ((BITBANDING_PERIPHERAL_I2C_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCI2C_I2C0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C5_BIT * 4UL))))

/******************************************************************************************
************************************66 RCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCUSB    ((BITBANDING_PERIPHERAL_USB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCUSB_USB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUSB_OFFSET) * 32UL) + (SYSCTL_RCGCUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************67 RCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCCAN    ((BITBANDING_PERIPHERAL_CAN_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCCAN_CAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCAN_OFFSET) * 32UL) + (SYSCTL_RCGCCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCCAN_CAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCAN_OFFSET) * 32UL) + (SYSCTL_RCGCCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************68 RCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCADC    ((BITBANDING_PERIPHERAL_ADC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCADC_OFFSET) * 32UL)))

