InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_RCGCADC_ADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCADC_OFFSET) * 32UL) + (SYSCTL_RCGCADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCADC_ADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCADC_OFFSET) * 32UL) + (SYSCTL_RCGCADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************69 RCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCACMP    ((BITBANDING_PERIPHERAL_ACMP_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCACMP_ACMP    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCACMP_OFFSET) * 32UL) + (SYSCTL_RCGCACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************70 RCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCPWM    ((BITBANDING_PERIPHERAL_PWM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCPWM_PWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPWM_OFFSET) * 32UL) + (SYSCTL_RCGCPWM_R_PWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCPWM_PWM1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPWM_OFFSET) * 32UL) + (SYSCTL_RCGCPWM_R_PWM1_BIT * 4UL))))

/******************************************************************************************
************************************71 RCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCQEI    ((BITBANDING_PERIPHERAL_QEI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCQEI_QEI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCQEI_OFFSET) * 32UL) + (SYSCTL_RCGCQEI_R_QEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCQEI_QEI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCQEI_OFFSET) * 32UL) + (SYSCTL_RCGCQEI_R_QEI1_BIT * 4UL))))

/******************************************************************************************
************************************72 RCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCEEPROM_EEPROM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEEPROM_OFFSET) * 32UL) + (SYSCTL_RCGCEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************73 RCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCWTIMER_WTIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCWTIMER_R_WTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCWTIMER_WTIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCWTIMER_R_WTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCWTIMER_WTIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCWTIMER_R_WTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCWTIMER_WTIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCWTIMER_R_WTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCWTIMER_WTIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCWTIMER_R_WTIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCWTIMER_WTIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCWTIMER_R_WTIMER5_BIT * 4UL))))

/******************************************************************************************
************************************74 SCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCWD    ((BITBANDING_PERIPHERAL_WD_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCWD_WDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWD_OFFSET) * 32UL) + (SYSCTL_SCGCWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCWD_WDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWD_OFFSET) * 32UL) + (SYSCTL_SCGCWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************75 SCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCTIMER    ((BITBANDING_PERIPHERAL_TIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCTIMER_TIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER5_BIT * 4UL))))

/******************************************************************************************
************************************76 SCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_TypeDef*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOA    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOB    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOC    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOD    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOE    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOF    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOG    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOH    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOJ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOK    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOL    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOM    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPION    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOP    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOQ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************77 SCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCDMA    ((BITBANDING_PERIPHERAL_DMA_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCDMA_OFFSET) * 32UL)))

