InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SCGCDMA_UDMA    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCDMA_OFFSET) * 32UL) + (SYSCTL_SCGCDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************78 SCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCHIB    ((BITBANDING_PERIPHERAL_HIB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCHIB_HIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCHIB_OFFSET) * 32UL) + (SYSCTL_SCGCHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************79 SCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCUART    ((BITBANDING_PERIPHERAL_UART_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCUART_UART0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART6    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART7    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************80 SCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCSSI    ((BITBANDING_PERIPHERAL_SSI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCSSI_SSI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCSSI_SSI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCSSI_SSI2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCSSI_SSI3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************81 SCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCI2C    ((BITBANDING_PERIPHERAL_I2C_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCI2C_I2C0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C5_BIT * 4UL))))

/******************************************************************************************
************************************82 SCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCUSB    ((BITBANDING_PERIPHERAL_USB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCUSB_USB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUSB_OFFSET) * 32UL) + (SYSCTL_SCGCUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************83 SCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCCAN    ((BITBANDING_PERIPHERAL_CAN_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCCAN_CAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCAN_OFFSET) * 32UL) + (SYSCTL_SCGCCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCCAN_CAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCAN_OFFSET) * 32UL) + (SYSCTL_SCGCCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************84 SCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCADC    ((BITBANDING_PERIPHERAL_ADC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCADC_ADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCADC_OFFSET) * 32UL) + (SYSCTL_SCGCADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCADC_ADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCADC_OFFSET) * 32UL) + (SYSCTL_SCGCADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************85 SCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCACMP    ((BITBANDING_PERIPHERAL_ACMP_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCACMP_ACMP    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCACMP_OFFSET) * 32UL) + (SYSCTL_SCGCACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************86 SCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCPWM    ((BITBANDING_PERIPHERAL_PWM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCPWM_PWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPWM_OFFSET) * 32UL) + (SYSCTL_SCGCPWM_R_PWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCPWM_PWM1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPWM_OFFSET) * 32UL) + (SYSCTL_SCGCPWM_R_PWM1_BIT * 4UL))))

/******************************************************************************************
************************************87 SCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCQEI    ((BITBANDING_PERIPHERAL_QEI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCQEI_QEI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCQEI_OFFSET) * 32UL) + (SYSCTL_SCGCQEI_R_QEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCQEI_QEI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCQEI_OFFSET) * 32UL) + (SYSCTL_SCGCQEI_R_QEI1_BIT * 4UL))))

/******************************************************************************************
************************************88 SCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCEEPROM_EEPROM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEEPROM_OFFSET) * 32UL) + (SYSCTL_SCGCEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************89 SCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCWTIMER_WTIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCWTIMER_R_WTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCWTIMER_WTIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCWTIMER_R_WTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCWTIMER_WTIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCWTIMER_R_WTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCWTIMER_WTIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCWTIMER_R_WTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCWTIMER_WTIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCWTIMER_R_WTIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCWTIMER_WTIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCWTIMER_R_WTIMER5_BIT * 4UL))))

/******************************************************************************************
************************************90 DCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCWD    ((BITBANDING_PERIPHERAL_WD_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCWD_WDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWD_OFFSET) * 32UL) + (SYSCTL_DCGCWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCWD_WDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWD_OFFSET) * 32UL) + (SYSCTL_DCGCWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************91 DCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCTIMER    ((BITBANDING_PERIPHERAL_TIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCTIMER_TIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER5_BIT * 4UL))))

/******************************************************************************************
************************************92 DCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_TypeDef*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOA    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOB    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOC    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOD    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOE    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOF    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOG    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOH    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOJ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOK    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOL    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOM    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPION    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOP    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOQ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************93 DCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCDMA    ((BITBANDING_PERIPHERAL_DMA_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCDMA_UDMA    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCDMA_OFFSET) * 32UL) + (SYSCTL_DCGCDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************94 DCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCHIB    ((BITBANDING_PERIPHERAL_HIB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCHIB_HIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCHIB_OFFSET) * 32UL) + (SYSCTL_DCGCHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************95 DCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCUART    ((BITBANDING_PERIPHERAL_UART_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCUART_UART0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART6    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART7    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************96 DCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCSSI    ((BITBANDING_PERIPHERAL_SSI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCSSI_SSI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCSSI_SSI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCSSI_SSI2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCSSI_SSI3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************97 DCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCI2C    ((BITBANDING_PERIPHERAL_I2C_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCI2C_I2C0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C5_BIT * 4UL))))

/******************************************************************************************
************************************98 DCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCUSB    ((BITBANDING_PERIPHERAL_USB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCUSB_USB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUSB_OFFSET) * 32UL) + (SYSCTL_DCGCUSB_R_USB_BIT * 4UL))))

