InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
/******************************************************************************************
************************************99 DCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCCAN    ((BITBANDING_PERIPHERAL_CAN_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCCAN_CAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCAN_OFFSET) * 32UL) + (SYSCTL_DCGCCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCCAN_CAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCAN_OFFSET) * 32UL) + (SYSCTL_DCGCCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************100 DCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCADC    ((BITBANDING_PERIPHERAL_ADC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCADC_ADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCADC_OFFSET) * 32UL) + (SYSCTL_DCGCADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCADC_ADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCADC_OFFSET) * 32UL) + (SYSCTL_DCGCADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************101 DCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCACMP    ((BITBANDING_PERIPHERAL_ACMP_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCACMP_ACMP    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCACMP_OFFSET) * 32UL) + (SYSCTL_DCGCACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************102 DCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCPWM    ((BITBANDING_PERIPHERAL_PWM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCPWM_PWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPWM_OFFSET) * 32UL) + (SYSCTL_DCGCPWM_R_PWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCPWM_PWM1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPWM_OFFSET) * 32UL) + (SYSCTL_DCGCPWM_R_PWM1_BIT * 4UL))))

/******************************************************************************************
************************************103 DCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCQEI    ((BITBANDING_PERIPHERAL_QEI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCQEI_QEI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCQEI_OFFSET) * 32UL) + (SYSCTL_DCGCQEI_R_QEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCQEI_QEI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCQEI_OFFSET) * 32UL) + (SYSCTL_DCGCQEI_R_QEI1_BIT * 4UL))))

/******************************************************************************************
************************************104 DCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCEEPROM_EEPROM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEEPROM_OFFSET) * 32UL) + (SYSCTL_DCGCEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************105 DCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCWTIMER_WTIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCWTIMER_R_WTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCWTIMER_WTIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCWTIMER_R_WTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCWTIMER_WTIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCWTIMER_R_WTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCWTIMER_WTIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCWTIMER_R_WTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCWTIMER_WTIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCWTIMER_R_WTIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCWTIMER_WTIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCWTIMER_R_WTIMER5_BIT * 4UL))))

/******************************************************************************************
************************************106 PRWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRWD    ((BITBANDING_PERIPHERAL_WD_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRWD_WDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWD_OFFSET) * 32UL) + (SYSCTL_PRWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRWD_WDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWD_OFFSET) * 32UL) + (SYSCTL_PRWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************107 PRTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRTIMER    ((BITBANDING_PERIPHERAL_TIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRTIMER_TIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER5_BIT * 4UL))))

/******************************************************************************************
************************************108 PRGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_TypeDef*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOA    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOB    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOC    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOD    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOE    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOF    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOG    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOH    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOJ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOK    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOL    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOM    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPION    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOP    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOQ    (*((volatile uint32_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************109 PRDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRDMA    ((BITBANDING_PERIPHERAL_DMA_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRDMA_UDMA    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRDMA_OFFSET) * 32UL) + (SYSCTL_PRDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************110 PRHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRHIB    ((BITBANDING_PERIPHERAL_HIB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRHIB_HIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRHIB_OFFSET) * 32UL) + (SYSCTL_PRHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************111 PRUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRUART    ((BITBANDING_PERIPHERAL_UART_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRUART_UART0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART6    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART7    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************112 PRSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRSSI    ((BITBANDING_PERIPHERAL_SSI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRSSI_SSI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRSSI_SSI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRSSI_SSI2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRSSI_SSI3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************113 PRI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRI2C    ((BITBANDING_PERIPHERAL_I2C_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL)))

