InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PRI2C_I2C0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C5_BIT * 4UL))))

/******************************************************************************************
************************************114 PRUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRUSB    ((BITBANDING_PERIPHERAL_USB_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRUSB_USB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUSB_OFFSET) * 32UL) + (SYSCTL_PRUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************115 PRCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRCAN    ((BITBANDING_PERIPHERAL_CAN_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRCAN_CAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCAN_OFFSET) * 32UL) + (SYSCTL_PRCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRCAN_CAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCAN_OFFSET) * 32UL) + (SYSCTL_PRCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************116 PRADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRADC    ((BITBANDING_PERIPHERAL_ADC_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRADC_ADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRADC_OFFSET) * 32UL) + (SYSCTL_PRADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRADC_ADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRADC_OFFSET) * 32UL) + (SYSCTL_PRADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************117 PRACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRACMP    ((BITBANDING_PERIPHERAL_ACMP_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRACMP_ACMP    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRACMP_OFFSET) * 32UL) + (SYSCTL_PRACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************118 PRPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRPWM    ((BITBANDING_PERIPHERAL_PWM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRPWM_PWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPWM_OFFSET) * 32UL) + (SYSCTL_PRPWM_R_PWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRPWM_PWM1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPWM_OFFSET) * 32UL) + (SYSCTL_PRPWM_R_PWM1_BIT * 4UL))))

/******************************************************************************************
************************************119 PRQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRQEI    ((BITBANDING_PERIPHERAL_QEI_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRQEI_QEI0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRQEI_OFFSET) * 32UL) + (SYSCTL_PRQEI_R_QEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRQEI_QEI1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRQEI_OFFSET) * 32UL) + (SYSCTL_PRQEI_R_QEI1_BIT * 4UL))))

/******************************************************************************************
************************************120 PREEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PREEPROM    ((BITBANDING_PERIPHERAL_EEPROM_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PREEPROM_EEPROM    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREEPROM_OFFSET) * 32UL) + (SYSCTL_PREEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************121 PRWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRWTIMER_WTIMER0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL) + (SYSCTL_PRWTIMER_R_WTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRWTIMER_WTIMER1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL) + (SYSCTL_PRWTIMER_R_WTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRWTIMER_WTIMER2    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL) + (SYSCTL_PRWTIMER_R_WTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRWTIMER_WTIMER3    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL) + (SYSCTL_PRWTIMER_R_WTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRWTIMER_WTIMER4    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL) + (SYSCTL_PRWTIMER_R_WTIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRWTIMER_WTIMER5    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL) + (SYSCTL_PRWTIMER_R_WTIMER5_BIT * 4UL))))

/**********************************************************************************
************************************122 DC0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC0    ((BITBANDING_DC0_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC0_OFFSET) * 32UL)))

/**********************************************************************************
************************************123 DC1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC1    ((BITBANDING_DC1_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC1_DCJTAG    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCJTAG_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCSWD    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCSWD_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCSWO    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCSWO_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCWDT0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCWDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCPLL    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCPLL_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCTEMPSNS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCTEMPSNS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCHIB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCHIB_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCMPU    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCMPU_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCADC0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCADC1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCADC1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCPWM0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCPWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCPWM1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCPWM1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCCAN0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCCAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCCAN1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCCAN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC1_DCWDT1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC1_OFFSET) * 32UL) + (SYSCTL_DC1_R_DCWDT1_BIT * 4UL))))

/**********************************************************************************
************************************124 DC2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC2    ((BITBANDING_DC2_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC2_DCUART0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCUART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCUART1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCUART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCUART2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCUART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCSSI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCSSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCSSI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCSSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCQEI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCQEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCQEI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCQEI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCI2C0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCI2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCI2C0HS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCI2C0HS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCI2C1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCI2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCI2C1HS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCI2C1HS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCTIMER0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCTIMER1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCTIMER2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCTIMER3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCCOMP0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCCOMP0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCCOMP1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCCOMP1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCCOMP2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCCOMP2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCI2S0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCI2S0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC2_DCEPI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC2_OFFSET) * 32UL) + SYSCTL_DC2_R_DCEPI0_BIT * 4UL))))

/**********************************************************************************
************************************125 DC3 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC3    ((BITBANDING_DC3_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC3_DCPWM0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCPWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCPWM1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCPWM1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCPWM2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCPWM2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCPWM3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCPWM3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCPWM4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCPWM4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCPWM5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCPWM5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC0MINUS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC0MINUS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC0PLUS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC0PLUS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC0O    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC0O_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC1MINUS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC1MINUS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC1PLUS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC1PLUS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC1O    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC1O_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC2MINUS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC2MINUS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC2PLUS    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC2PLUS_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCC2O    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCC2O_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCPWMFAULT    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCPWMFAULT_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCADC0AIN7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCADC0AIN7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCCCP0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCCCP0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCCCP1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCCCP1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCCCP2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCCCP2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCCCP3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCCCP3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCCCP4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCCCP4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DCCCP5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DCCCP5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC3_DC32KHZ    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC3_OFFSET) * 32UL) + SYSCTL_DC3_R_DC32KHZ_BIT * 4UL))))

/**********************************************************************************
************************************126 DC4 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC4    ((BITBANDING_DC4_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL)))

