InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_DC4_DCGPIOA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOC    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOD    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOE    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOF    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOG    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOH    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCGPIOJ    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCGPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCROM    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCROM_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCUDMA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCUDMA_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCCCP6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCCCP6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCCCP7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCCCP7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCPICAL    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCPICAL_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCE1588    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCE1588_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCEMAC0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCEMAC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC4_DCEPHY0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC4_OFFSET) * 32UL) + SYSCTL_DC4_R_DCEPHY0_BIT * 4UL))))

/**********************************************************************************
************************************127 DC5 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC5    ((BITBANDING_DC5_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC5_DCPWM0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWM1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWM2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWM3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWM4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWM5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWM6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWM7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWM7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWMESYNC    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWMESYNC_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWMEFLT    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWMEFLT_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWMFAULT0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWMFAULT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWMFAULT1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWMFAULT1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWMFAULT2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWMFAULT2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC5_DCPWMFAULT3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC5_OFFSET) * 32UL) + SYSCTL_DC5_R_DCPWMFAULT3_BIT * 4UL))))

/**********************************************************************************
************************************128 DC6 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC6    ((BITBANDING_DC6_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC6_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC6_DCUSB0PHY    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC6_OFFSET) * 32UL) + (SYSCTL_DC6_R_DCUSB0PHY_BIT * 4UL))))

/**********************************************************************************
************************************129 DC7 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC7    ((BITBANDING_DC7_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC7_DCDMACH0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH8    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH8_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH9    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH9_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH10    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH10_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH11    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH11_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH12    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH12_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH13    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH13_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH14    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH14_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH15    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH15_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH16    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH16_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH17    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH17_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH18    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH18_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH19    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH19_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH20    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH20_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH21    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH21_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH22    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH22_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH23    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH23_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH24    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH24_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH25    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH25_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH26    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH26_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH27    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH27_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH28    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH28_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH29    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH29_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC7_DCDMACH30    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC7_OFFSET) * 32UL) + SYSCTL_DC7_R_DCDMACH30_BIT * 4UL))))

/**********************************************************************************
************************************130 DC8 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC8    ((BITBANDING_DC8_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC8_DCADC0AIN0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN8    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN8_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN9    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN9_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN10    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN10_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN11    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN11_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN12    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN12_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN13    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN13_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN14    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN14_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC0AIN15    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC0AIN15_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN8    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN8_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN9    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN9_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN10    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN10_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN11    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN11_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN12    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN12_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN13    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN13_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN14    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN14_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC8_DCADC1AIN15    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC8_OFFSET) * 32UL) + SYSCTL_DC8_R_DCADC1AIN15_BIT * 4UL))))

/**********************************************************************************
************************************131 SRCR0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRCR0    ((BITBANDING_SRCR0_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRCR0_SRCRWDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRWDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR0_SRCRHIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRHIB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR0_SRCRADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR0_SRCRADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRADC1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR0_SRCRPWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRPWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR0_SRCRCAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRCAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR0_SRCRCAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRCAN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR0_SRCRWDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR0_OFFSET) * 32UL) + SYSCTL_SRCR0_R_SRCRWDT1_BIT * 4UL))))

/**********************************************************************************
************************************132 SRCR1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRCR1    ((BITBANDING_SRCR1_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL)))

