InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SRCR1_SRCRUART0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRUART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRUART1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRUART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRUART2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRUART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRSSI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRSSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRSSI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRSSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRQEI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRQEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRQEI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRQEI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRI2C0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRI2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRI2C1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRI2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRTIMER0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRTIMER1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRTIMER2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRTIMER3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRCOMP0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRCOMP0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR1_SRCRCOMP1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR1_OFFSET) * 32UL) + (SYSCTL_SRCR1_R_SRCRCOMP1_BIT * 4UL))))

/**********************************************************************************
************************************133 SRCR2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRCR2    ((BITBANDING_SRCR2_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRCR2_SRCRGPIOA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRGPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR2_SRCRGPIOB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRGPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR2_SRCRGPIOC    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRGPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR2_SRCRGPIOD    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRGPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR2_SRCRGPIOE    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRGPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR2_SRCRGPIOF    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRGPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR2_SRCRUDMA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRUDMA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCR2_SRCRUSB0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCR2_OFFSET) * 32UL) + (SYSCTL_SRCR2_R_SRCRUSB0_BIT * 4UL))))

/**********************************************************************************
************************************134 RCGC0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGC0    ((BITBANDING_RCGC0_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGC0_RCGCWDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCWDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC0_RCGCHIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCHIB_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC0_RCGCADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC0_RCGCADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCADC1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC0_RCGCPWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCPWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC0_RCGCCAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCCAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC0_RCGCCAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCCAN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC0_RCGCWDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC0_OFFSET) * 32UL) + (SYSCTL_RCGC0_R_RCGCWDT1_BIT * 4UL))))

/**********************************************************************************
************************************135 RCGC1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGC1    ((BITBANDING_RCGC1_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGC1_RCGCUART0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCUART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCUART1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCUART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCUART2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCUART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCSSI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCSSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCSSI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCSSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCQEI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCQEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCQEI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCQEI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCI2C0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCI2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCI2C1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCI2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCTIMER0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCTIMER1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCTIMER2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCTIMER3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCCOMP0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCCOMP0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC1_RCGCCOMP1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC1_OFFSET) * 32UL) + (SYSCTL_RCGC1_R_RCGCCOMP1_BIT * 4UL))))

/**********************************************************************************
************************************136 RCGC2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGC2    ((BITBANDING_RCGC2_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGC2_RCGCGPIOA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCGPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC2_RCGCGPIOB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCGPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC2_RCGCGPIOC    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCGPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC2_RCGCGPIOD    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCGPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC2_RCGCGPIOE    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCGPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC2_RCGCGPIOF    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCGPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC2_RCGCUDMA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCUDMA_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGC2_RCGCUSB0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGC2_OFFSET) * 32UL) + (SYSCTL_RCGC2_R_RCGCUSB0_BIT * 4UL))))

/**********************************************************************************
************************************137 SCGC0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGC0    ((BITBANDING_SCGC0_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGC0_SCGCWDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCWDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC0_SCGCHIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCHIB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC0_SCGCADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC0_SCGCADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCADC1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC0_SCGCPWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCPWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC0_SCGCCAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCCAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC0_SCGCCAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCCAN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC0_SCGCWDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC0_OFFSET) * 32UL) + (SYSCTL_SCGC0_R_SCGCWDT1_BIT * 4UL))))

/**********************************************************************************
************************************138 SCGC1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGC1    ((BITBANDING_SCGC1_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGC1_SCGCUART0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCUART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCUART1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCUART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCUART2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCUART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCSSI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCSSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCSSI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCSSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCQEI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCQEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCQEI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCQEI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCI2C0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCI2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCI2C1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCI2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCTIMER0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCTIMER1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCTIMER2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCTIMER3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCCOMP0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCCOMP0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC1_SCGCCOMP1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC1_OFFSET) * 32UL) + (SYSCTL_SCGC1_R_SCGCCOMP1_BIT * 4UL))))

/**********************************************************************************
************************************139 SCGC2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGC2    ((BITBANDING_SCGC2_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGC2_SCGCGPIOA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCGPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC2_SCGCGPIOB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCGPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC2_SCGCGPIOC    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCGPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC2_SCGCGPIOD    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCGPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC2_SCGCGPIOE    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCGPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC2_SCGCGPIOF    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCGPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC2_SCGCUDMA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCUDMA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGC2_SCGCUSB0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGC2_OFFSET) * 32UL) + (SYSCTL_SCGC2_R_SCGCUSB0_BIT * 4UL))))

/**********************************************************************************
************************************140 DCGC0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGC0    ((BITBANDING_DCGC0_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGC0_DCGCWDT0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCWDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC0_DCGCHIB    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCHIB_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC0_DCGCADC0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC0_DCGCADC1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCADC1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC0_DCGCPWM0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCPWM0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC0_DCGCCAN0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCCAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC0_DCGCCAN1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCCAN1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC0_DCGCWDT1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC0_OFFSET) * 32UL) + (SYSCTL_DCGC0_R_DCGCWDT1_BIT * 4UL))))

/**********************************************************************************
************************************141 DCGC1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGC1    ((BITBANDING_DCGC1_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL)))

