InDeviceMex/TM4C123/TM4C123_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_DCGC1_DCGCUART0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCUART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCUART1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCUART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCUART2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCUART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCSSI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCSSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCSSI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCSSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCQEI0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCQEI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCQEI1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCQEI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCI2C0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCI2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCI2C1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCI2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCTIMER0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCTIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCTIMER1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCTIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCTIMER2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCTIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCTIMER3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCTIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCCOMP0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCCOMP0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC1_DCGCCOMP1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC1_OFFSET) * 32UL) + (SYSCTL_DCGC1_R_DCGCCOMP1_BIT * 4UL))))

/**********************************************************************************
************************************142 DCGC2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGC2    ((BITBANDING_DCGC2_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGC2_DCGCGPIOA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCGPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC2_DCGCGPIOB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCGPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC2_DCGCGPIOC    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCGPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC2_DCGCGPIOD    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCGPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC2_DCGCGPIOE    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCGPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC2_DCGCGPIOF    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCGPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC2_DCGCUDMA    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCUDMA_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGC2_DCGCUSB0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGC2_OFFSET) * 32UL) + (SYSCTL_DCGC2_R_DCGCUSB0_BIT * 4UL))))

/**********************************************************************************
************************************143 DC9 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DC9    ((BITBANDING_DC9_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DC9_DCADC0DC0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC0DC1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC0DC2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC0DC3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC0DC4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC0DC5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC0DC6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC0DC7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC0DC7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC0    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC1    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC2    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC3    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC4    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC5    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC6    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DC9_DCADC1DC7    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DC9_OFFSET) * 32UL) + (SYSCTL_DC9_R_DCADC1DC7_BIT * 4UL))))

/**********************************************************************************
************************************144 NVMSTAT *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_NVMSTAT    ((BITBANDING_NVMSTAT_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NVMSTAT_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_NVMSTAT_FWB    (*((volatile const uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NVMSTAT_OFFSET) * 32UL) + (SYSCTL_NVMSTAT_R_FWB_BIT * 4UL))))

/******************************************************************************************
************************************ 145-Flash RMCTL *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RMCTL    ((BITBANDING_RMCTL_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RMCTL_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RMCTL_BA    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RMCTL_OFFSET) * 32UL) + (SYSCTL_RMCTL_R_BA_BIT * 4UL))))

/******************************************************************************************
************************************ 146-Flash FMPRE0_ALIAS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPRE0_ALIAS    ((BITBANDING_FMPRE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPRE0_ALIAS_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 147-Flash FMPRE0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPRE0    ((BITBANDING_FMPRE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPRE0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 148-Flash FMPRE1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPRE1    ((BITBANDING_FMPRE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPRE1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 149-Flash FMPRE2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPRE2    ((BITBANDING_FMPRE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPRE2_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 150-Flash FMPRE3 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPRE3    ((BITBANDING_FMPRE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPRE3_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 151-Flash FMPPE0_ALIAS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPPE0_ALIAS    ((BITBANDING_FMPPE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPPE0_ALIAS_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 152-Flash FMPPE0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPPE0    ((BITBANDING_FMPPE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPPE0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 153-Flash FMPPE1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPPE1    ((BITBANDING_FMPPE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPPE1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 154-Flash FMPPE2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPPE2    ((BITBANDING_FMPPE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPPE2_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 155-Flash FMPPE3 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_FMPPE3    ((BITBANDING_FMPPE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_FMPPE3_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 156-Flash BOOTCFG *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_BOOTCFG    ((BITBANDING_FMPPE_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_BOOTCFG_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_BOOTCFG_DBG0    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_BOOTCFG_OFFSET) * 32UL) + (SYSCTL_BOOTCFG_R_DBG0_BIT * 4UL))))
#define SYSCTL_BITBANDING_BOOTCFG_DBG1    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_BOOTCFG_OFFSET) * 32UL) + (SYSCTL_BOOTCFG_R_DBG1_BIT * 4UL))))
#define SYSCTL_BITBANDING_BOOTCFG_KEY    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_BOOTCFG_OFFSET) * 32UL) + (SYSCTL_BOOTCFG_R_KEY_BIT * 4UL))))
#define SYSCTL_BITBANDING_BOOTCFG_ENA    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_BOOTCFG_OFFSET) * 32UL) + (SYSCTL_BOOTCFG_R_EN_BIT * 4UL))))
#define SYSCTL_BITBANDING_BOOTCFG_POL    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_BOOTCFG_OFFSET) * 32UL) + (SYSCTL_BOOTCFG_R_POL_BIT * 4UL))))
#define SYSCTL_BITBANDING_BOOTCFG_NW    (*((volatile uint32_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_BOOTCFG_OFFSET) * 32UL) + (SYSCTL_BOOTCFG_R_NW_BIT * 4UL))))

/******************************************************************************************
************************************ 157-Flash USER_REG0 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_USER_REG0    ((BITBANDING_USER_REG_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_USER_REG0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 158-Flash USER_REG1 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_USER_REG1    ((BITBANDING_USER_REG_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_USER_REG1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 159-Flash USER_REG2 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_USER_REG2    ((BITBANDING_USER_REG_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_USER_REG2_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 160-Flash USER_REG3 *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_USER_REG3    ((BITBANDING_USER_REG_TypeDef*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_USER_REG3_OFFSET) * 32UL)))

#endif /* XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_BITBANDING_H_ */
